<%--
  Created by IntelliJ IDEA.
  User: ashley_wsm
  Date: 2017/3/14
  Time: 15:22
  To change this template use File | Settings | File Templates.
--%>
<%@ page language="java" contentType="text/html; charset=UTF-8"
         pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>

<html lang ="zh-cn">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width,initial-scale=1">
    <title>鲁通卡用户分析系统</title>
    <link href="css/bootstrap.min.css" rel="stylesheet">
    <link href="css/bootstrap-theme.min.css" rel="stylesheet">
</head>

<body>
<script type="text/javascript" src="js/jquery-1.10.2.min.js"></script>
<script src="js/bootstrap.min.js"></script>
<script type="text/javascript" src="http://api.map.baidu.com/api?v=2.0&ak=t65FFKL6S3wBE51a06KGMyEm"></script>
<script src="js/echarts.js"></script>
<script type="text/javascript" src="js/main.js"></script>
<style type="text/css"> @import "css/workspace.css";</style>

<nav class="navbar navbar-fixed-top" role="navigation" id="nav1">
    <div class="container-fluid">
        <div class="navbar-header">
            <a class="navbar-brand" href="#" id="Title1">鲁通卡用户分析系统</a>
        </div>
        <div>
            <form class="navbar-form navbar-right" role="search">
                <div class="form-group">
                    <input type="date" class="form-control" id="date_start"/>
                    <input type="date" class="form-control" id ="date_end">
                    <input type="text" class="form-control" id="province"/>
                </div>
                <button type="submit" onclick="submit_button()">提交</button>
            </form>
        </div>
    </div>

</nav>
<div class="main" id="main"></div>
<script type="text/javascript">
    var maindiv = document.getElementById("main");
    maindiv.style.height = document.body.clientHeight-101+"px";
</script>
<nav class="navbar navbar-fixed-bottom" role="navigation" id="nav2">
    <div>
        <ul class="nav nav-tabs nav-justified">
            <li><a href="">所占比例</a></li>
            <li><a href="">出行路线</a></li>
            <li class="active"><a href="">热门OD</a></li>
        </ul>
    </div>
</nav>

</body>
<script type="text/javascript">

    function submit_button(){
        $.post(
            "${ContextPath}/login/workspace/highwayline/two",
            {
                "date_start":$('#date_start').val(),
                "date_end":$('#date_end').val(),
                "province":$('#province').val()
            },
            function(data){
                if(data=="error"){
                    console.log("error");
                }else{
                    od = data;
                }
            }
        );
        $.post(
            "${ContextPath}/login/workspace/highwayline/one",
            {
                "province":$('#province').val()
            },
            function (data) {
                zones = data;
            }
        )
    }

    (function(){

        require.config({
            paths: {
                echarts: 'http://echarts.baidu.com/build/dist'
            },
            packages: [
                {
                    name: 'BMap',
                    location: 'js',
                    main: 'main'
                }
            ]
        });
        // 使用
        require(
            [
                'echarts',
                'BMap',
                'echarts/chart/map' //
            ],

            function (echarts, BMapExtension) {
                // 基于准备好的dom，初始化echarts图表
                // 初始化地图
                var mapcon = document.getElementById("main");
                var BMapExt = new BMapExtension(mapcon, BMap, echarts,{
                    enableMapClick: false
                });
                var map = BMapExt.getMap();
                var container = BMapExt.getEchartsContainer();

                var startPoint = {x:118.881323,y:36.670064};
                var point = new BMap.Point(startPoint.x, startPoint.y);
                map.centerAndZoom(point, 9);
                map.enableScrollWheelZoom(true);
                // 地图自定义样式
                map.setMapStyle({
                    styleJson: [
                        {
                            "featureType": "water",
                            "elementType": "all",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "land",
                            "elementType": "all",
                            "stylers": {
                                "color": "#212121"
                            }
                        },
                        {
                            "featureType": "boundary",
                            "elementType": "geometry",
                            "stylers": {
                                "color": "#212121"
                            }
                        },
                        {
                            "featureType": "railway",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "highway",
                            "elementType": "geometry",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "highway",
                            "elementType": "geometry.fill",
                            "stylers": {
                                "color": "#404a59",
                                "lightness": 1
                            }
                        },
                        {
                            "featureType": "highway",
                            "elementType": "labels",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "arterial",
                            "elementType": "geometry",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "arterial",
                            "elementType": "geometry.fill",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "poi",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "green",
                            "elementType": "all",
                            "stylers": {
                                "color": "#404a59",
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "subway",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "manmade",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "local",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "arterial",
                            "elementType": "labels",
                            "stylers": {
                                "visibility": "off"
                            }
                        },
                        {
                            "featureType": "boundary",
                            "elementType": "geometry.fill",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "building",
                            "elementType": "all",
                            "stylers": {
                                "color": "#404a59"
                            }
                        },
                        {
                            "featureType": "label",
                            "elementType": "all",
                            "stylers": {
                                "visibility": "off"
                            }
                        }
                    ]
                });
                option = {
                    color: ['gold', 'aqua', 'lime'],
                    title: {
                        text: '山东省内热门OD',
                        x: 'center',
                        textStyle: {
                            color: '#fff'
                        }
                    },
                    tooltip: {
                        trigger: 'item',
                        formatter: function(v) {
                            return v[1].replace(':', ' > ');
                        }
                    },
                    legend: {
                        orient: 'vertical',
                        x: 'left',
                        data: ['开始站之华山收费站', '开始站之青岛东收费站'],
                        selectedMode: 'single',
                        selected: {
                            '结束站之黄岛收费站': false,
                            '开始站之青岛东收费站': false
                        },
                        textStyle: {
                            color: '#fff'
                        }
                    },
                    toolbox: {
                        show: true,
                        orient: 'vertical',
                        x: 'right',
                        y: 'center',
                        feature: {
                            mark: { show: true },
                            dataView: { show: true, readOnly: false },
                            restore: { show: true },
                            saveAsImage: { show: true }
                        }
                    },
                    dataRange: {
                        min: 0,
                        max: 3000,
                        x: 'right',
                        calculable: true,
                        color: ['#ff3333', 'orange', 'yellow', 'lime', 'aqua'],
                        textStyle: {
                            color: '#fff'
                        }
                    },
                    series: [{
                        name: '开始站之华山收费站',
                        type: 'map',
                        mapType: 'none',
                        center: [117.04042, 36.73925],
                        data: [],
                        geoCoord: {
                            '莘县古城收费站':[115.61036,35.93262],
                            '范县收费站':[115.4941,35.79546],
                            '高村浮桥收费站':[115.04596,35.37217],
                            '长兴浮桥收费站':[114.84823,35.16105],
                            '位山闸管所收费站':[116.12778,36.14271],
                            '沂源收费站':[118.13343,36.1556],
                            '高青收费站':[117.91767,37.08203],
                            '郓城收费站':[115.83556,35.41416],
                            '菏泽新北收费站':[115.66399,35.27856],
                            '菏泽新北收费站':[115.66408,35.27854],
                            '位山闸管所收费站':[116.1275,36.14268],
                            '聊城东收费站':[116.02784,36.49778],
                            '鱼龙浮桥收费站':[116.20679,36.16607],
                            '聊城东收费站':[116.0279,36.49122],
                            '伟庄浮桥收费站':[115.85707,35.8511],
                            '聊城开发区收费站':[116.09126,36.49549],
                            '国道３２７菏泽收费站':[115.68454,35.27377],
                            '聊城东收费站':[116.02816,36.49777],
                            '东明黄河公路大桥收费站':[115.12654,35.37886],
                            '古营集收费站':[115.64132,34.93846],
                            '鱼龙浮桥收费站':[116.20773,36.17233],
                            '沂源收费站':[118.13329,36.15557],
                            '菏泽收费站':[115.34166,35.25966],
                            '聊城东收费站':[116.02819,36.49125],
                            '古营集收费站':[115.64139,34.93847],
                            '菏泽收费站':[115.51431,35.28998],
                            '莱芜北收费站':[117.65003,36.30247],
                            '菏泽收费站':[115.51432,35.28989],
                            '菏泽东收费站':[115.57389,35.29077],
                            '菏泽东收费站':[115.57397,35.29073],
                            '莱芜北收费站':[117.64995,36.3025],
                            '省道２２８线东营收费站':[118.34934,37.37065],
                            '聊城开发区收费站':[116.09134,36.4955],
                            '聊城开发区收费站':[116.08543,36.49867],
                            '牡丹收费站':[115.42167,35.13195],
                            '菏泽西收费站':[115.41521,35.29111],
                            '菏泽西收费站':[115.41526,35.29102],
                            '济宁西收费站':[116.4356,35.5041],
                            '高青收费站':[117.91753,37.08203],
                            '牡丹收费站':[115.4217,35.13188],
                            '省道１０２线２－１收费站':[117.3383,36.73738],
                            '高唐收费站':[116.234,36.91573],
                            '禹城南收费站':[116.65127,36.87387],
                            '高青收费站':[117.97327,37.18575],
                            '禹城南收费站':[116.65125,36.87395],
                            '高唐收费站':[116.23396,36.91566],
                            '汶上南收费站':[116.42951,35.66495],
                            '高青北收费站':[117.96616,37.24449],
                            '聊城开发区收费站':[116.08552,36.49868],
                            '汶上西收费站':[116.41802,35.73119],
                            '高青收费站':[117.97317,37.18576],
                            '汶上西收费站':[116.41802,35.73109],
                            '博山收费站':[117.83773,36.52495],
                            '齐河南收费站':[116.7716,36.75346],
                            '邹城收费站':[117.06337,35.40911],
                            '峄山收费站':[117.08934,35.30086],
                            '峄山收费站':[117.08939,35.30083],
                            '汶上南收费站':[116.42956,35.665],
                            '邹城收费站':[117.06344,35.40918],
                            '聊城西收费站':[115.87096,36.46933],
                            '聊城西收费站':[115.87115,36.46935],
                            '章丘收费站':[117.50877,36.86532],
                            '章丘收费站':[117.50883,36.86525],
                            '济南济章黄河浮桥收费站':[117.24125,36.97584],
                            '章丘收费站':[117.50868,36.86158],
                            '东平南收费站':[116.41406,35.81228],
                            '章丘收费站':[117.50859,36.8615],
                            '齐河收费站':[116.79055,36.80294],
                            '济宁北收费站':[116.53023,35.53258],
                            '齐河收费站':[116.79035,36.80289],
                            '菏泽新区收费站':[115.5884,35.22344],
                            '道口铺收费站':[115.84404,36.4829],
                            '菏泽新区收费站':[115.58847,35.22339],
                            '鑫通浮桥收费站':[116.05479,35.98255],
                            '济宁北收费站':[116.53024,35.53265],
                            '临淄收费站':[118.30543,36.8526],
                            '临淄收费站':[118.30546,36.85271],
                            '德州南收费站':[116.38179,37.3744],
                            '曲阜北收费站':[117.05947,35.73893],
                            '德州南收费站':[116.38182,37.37447],
                            '曲阜北收费站':[117.05966,35.73892],
                            '陈庄收费站':[118.50621,37.70805],
                            '泰安南收费站':[117.0983,36.14442],
                            '陈庄收费站':[118.50631,37.7081],
                            '泰安南收费站':[117.09826,36.14437],
                            '泰肥收费站':[117.02966,36.15166],
                            '齐河西收费站':[116.64798,36.70494],
                            '泰肥收费站':[117.02973,36.15175],
                            '齐河西收费站':[116.64803,36.70487],
                            '齐河西收费站':[116.64955,36.70244],
                            '齐河西收费站':[116.6496,36.70231],
                            '遥墙收费站':[117.18455,36.81749],
                            '遥墙收费站':[117.18464,36.81752],
                            '临邑收费站':[116.75293,37.23571],
                            '齐河东收费站':[116.85534,36.79636],
                            '临邑收费站':[116.75289,37.23562],
                            '道口铺收费站':[115.844,36.48283],
                            '齐河南收费站':[116.77157,36.75351],
                            '齐河东收费站':[116.85546,36.79635],
                            '东平收费站':[116.41499,35.9302],
                            '东平收费站':[116.41486,35.93014],
                            '禹城收费站':[116.6812,36.96938],
                            '郓城收费站':[115.83545,35.41422],
                            '禹城收费站':[116.68107,36.96935],
                            '国道３２７菏泽收费站':[115.68454,35.27385],
                            '鄄城浮桥收费站':[115.51437,35.68647],
                            '菏泽收费站':[115.34166,35.25959],
                            '景店收费站':[115.55941,35.04188],
                            '鲁豫收费站':[115.10146,34.99479],
                            '豫鲁省界收费站':[115.1021,34.99417],
                            '莱芜西收费站':[117.59724,36.19899],
                            '埠村收费站':[117.47689,36.60222],
                            '夏津收费站':[116.01929,37.00417],
                            '曹范收费站':[117.39956,36.61125],
                            '新泰东收费站':[117.82446,35.92784],
                            '莱芜西收费站':[117.59724,36.19875],
                            '埠村收费站':[117.47695,36.60229],
                            '集贤收费站':[118.53367,37.64553],
                            '鑫通浮桥收费站':[116.0456,35.98287],
                            '曹范收费站':[117.39952,36.61115],
                            '夏津收费站':[116.01937,37.00412],
                            '集贤收费站':[118.53384,37.6454],
                            '淄博收费站':[118.08024,36.85963],
                            '新泰东收费站':[117.82463,35.92782],
                            '德州收费站':[116.38472,37.42133],
                            '德州收费站':[116.38441,37.42122],
                            '淄博收费站':[118.08018,36.85969],
                            '淄博新区收费站':[117.95425,36.78411],
                            '淄博新区收费站':[117.95415,36.78417],
                            '钢城收费站':[117.79321,36.07524],
                            '钢城收费站':[117.79318,36.07565],
                            '范镇收费站':[117.39877,36.20863],
                            '范镇收费站':[117.39959,36.21067],
                            '陈山口收费站':[116.21733,36.11954],
                            '蟠龙收费站':[117.22366,36.62815],
                            '蟠龙收费站':[117.22365,36.62808],
                            '港沟收费站':[117.17618,36.62968],
                            '定陶收费站':[115.64358,35.03548],
                            '港沟收费站':[117.17634,36.62978],
                            '泰安东收费站':[117.17076,36.1473],
                            '杨庄收费站':[117.44701,36.22308],
                            '泰安东收费站':[117.17115,36.14708],
                            '杨庄收费站':[117.44711,36.22308],
                            '胜利大桥收费站':[118.55731,37.59955],
                            '范镇收费站':[117.39956,36.21078],
                            '友谊浮桥收费站':[116.69811,36.60791],
                            '友谊浮桥收费站':[116.69553,36.61111],
                            '平安浮桥收费站':[116.7326,36.61367],
                            '定陶收费站':[115.64351,35.03548],
                            '鲁村收费站':[117.98849,36.19496],
                            '一零五国道曹县青堌集收费站':[115.78701,34.66574],
                            '聊城城北收费站':[116.07638,36.548],
                            '聊城收费站':[115.95357,36.4863],
                            '聊城收费站':[115.95718,36.48308],
                            '范镇收费站':[117.39874,36.20872],
                            '聊城收费站':[115.95374,36.4863],
                            '化马湾收费站':[117.43338,36.06668],
                            '崮山收费站':[116.85302,36.55674],
                            '聊城城北收费站':[116.07649,36.54797],
                            '崮山收费站':[116.84728,36.55171],
                            '聊城收费站':[115.95707,36.48307],
                            '滨州北收费站':[117.91061,37.49478],
                            '李清浮桥收费站':[115.754,35.82799],
                            '滨州北收费站':[117.91072,37.49475],
                            '平阴南收费站':[116.44582,36.10083],
                            '平阴南收费站':[116.44582,36.10091],
                            '磁窑收费站':[117.06798,35.91142],
                            '磁窑收费站':[117.06795,35.91155],
                            '胜利大桥收费站':[118.55741,37.5996],
                            '华山收费站':[117.10782,36.75061],
                            '济南东郊黄河浮桥收费站':[117.0943,36.78462],
                            '济南建邦黄河大桥收费站':[116.93284,36.75058],
                            '东营收费站':[118.6014,37.40208],
                            '济南建邦黄河大桥收费站':[116.93245,36.75051],
                            '东营收费站':[118.60153,37.40215],
                            '滨州南收费站':[117.93117,37.30035],
                            '华山收费站':[117.10772,36.75067],
                            '滨州南收费站':[117.93117,37.30024],
                            '华山收费站':[117.10498,36.75399],
                            '滨州市黄河浮桥收费站':[117.95953,37.28982],
                            '豫鲁收费站':[115.69009,34.55486],
                            '鲁豫收费站':[115.68936,34.55457],
                            '化马湾收费站':[117.43345,36.06666],
                            '鱼姜浮桥收费站':[116.22893,36.17154],
                            '京九浮桥收费站':[115.89381,35.91937],
                            '新泰南收费站':[117.68683,35.84993],
                            '京九浮桥收费站':[115.8928,35.92334],
                            '新泰南收费站':[117.68699,35.84965],
                            '孤岛收费站':[118.75306,37.87347],
                            '孤岛收费站':[118.75306,37.87355],
                            '沾化东收费站':[118.168,37.735],
                            '沾化东收费站':[118.16806,37.73492],
                            '崮山收费站':[116.85289,36.55685],
                            '山东淄博惠青大桥高青收费站':[117.61561,37.24611],
                            '滨州港收费站':[117.90414,37.73332],
                            '滨州港收费站':[117.90417,37.73324],
                            '华山收费站':[117.10489,36.75404],
                            '机场收费站':[117.20527,36.84192],
                            '济南东城黄河浮桥收费站':[117.1701,36.86123],
                            '和庄收费站':[117.81937,36.40736],
                            '机场收费站':[117.20564,36.84191],
                            '和庄收费站':[117.81935,36.40726],
                            '曲阜南收费站':[116.98458,35.53373],
                            '曲阜南收费站':[116.98458,35.53387],
                            '东明黄河公路大桥收费站':[115.12644,35.37886],
                            '双八收费站':[115.70877,34.5301],
                            '山东淄博惠青大桥高青收费站':[117.61572,37.24622],
                            '双八收费站':[115.70889,34.53013],
                            '周村收费站':[117.87081,36.85708],
                            '东营港收费站':[118.89848,38.04635],
                            '省道３５３线德城南收费站':[116.29646,37.39378],
                            '省道３５３线德城南收费站':[116.29654,37.39384],
                            '马场收费站':[118.70223,37.79709],
                            '马场收费站':[118.70218,37.79716],
                            '邹平收费站':[117.76017,36.86604],
                            '邹平收费站':[117.7602,36.86598],
                            '邹平收费站':[117.75954,36.8689],
                            '邹平收费站':[117.75953,36.86882],
                            '周村收费站':[117.87086,36.857],
                            '黄河浮桥收费站':[116.99402,36.72833],
                            '古城收费站':[117.8371,37.6996],
                            '古城收费站':[117.837,37.69948],
                            '东营港收费站':[118.89833,38.04637],
                            '利津收费站':[118.36302,37.70727],
                            '利津收费站':[118.36306,37.70733],
                            '沾化西收费站':[118.07716,37.73524],
                            '沾化西收费站':[118.07719,37.73531],
                            '阴河浮桥收费站':[116.66333,36.57733],
                            '兖州收费站':[116.79835,35.51464],
                            '阴河浮桥收费站':[116.66208,36.57996],
                            '兖州收费站':[116.79829,35.51475],
                            '堌阳收费站':[114.99304,34.9529],
                            '淄川收费站':[117.8819,36.66167],
                            '孝里收费站':[116.63828,36.38678],
                            '鲁村收费站':[117.98838,36.19497],
                            '堌阳收费站':[114.99288,34.95283],
                            '孝里收费站':[116.63823,36.38672],
                            '山东淄博惠青大桥高青收费站':[117.65205,37.24161],
                            '山东淄博惠青大桥高青收费站':[117.65205,37.24149],
                            '滨州收费站':[117.91496,37.36403],
                            '郭店收费站':[117.20874,36.72538],
                            '郭店收费站':[117.20867,36.72539],
                            '济阳黄河大桥收费站':[117.18288,36.93533],
                            '济阳黄河大桥收费站':[117.18283,36.9352],
                            '嘉祥收费站':[116.35424,35.48018],
                            '嘉祥收费站':[116.35415,35.48011],
                            '省道２２８线东营收费站':[118.34924,37.37068],
                            '东平南收费站':[116.41408,35.81216],
                            '范县东收费站':[115.5751,35.85991],
                            '范县东收费站':[115.57547,35.85986],
                            '聊城西收费站':[115.9007,36.46565],
                            '莘县南收费站':[115.65018,36.08524],
                            '万德收费站':[116.91118,36.34842],
                            '莘县北收费站':[115.75096,36.26871],
                            '平阴黄河大桥收费站':[116.35755,36.3076],
                            '豫鲁界收费站':[115.54075,35.8175],
                            '莘县古城收费站':[115.61016,35.93262],
                            '万德收费站':[116.91118,36.34831],
                            '莘县收费站':[115.70429,36.19221],
                            '聊城南收费站':[115.87957,36.39331],
                            '鲁豫界收费站':[115.54049,35.81827],
                            '莘县收费站':[115.70439,36.19198],
                            '聊城西收费站':[115.9004,36.46573],
                            '平阴黄河大桥收费站':[116.36293,36.29837],
                            '莘县北收费站':[115.75129,36.26863],
                            '淄川收费站':[117.81041,36.66125],
                            '淄川收费站':[117.81042,36.66116],
                            '仙河收费站':[118.81179,37.93684],
                            '仙河收费站':[118.81183,37.93692],
                            '济北黄河浮桥收费站':[117.03508,36.75703],
                            '富民浮桥收费站':[116.10881,36.07986],
                            '富民浮桥收费站':[116.11286,36.07898],
                            '济北黄河浮桥收费站':[117.03506,36.7571],
                            '滨州收费站':[117.91482,37.36405],
                            '滨城收费站':[117.90636,37.4142],
                            '黄河浮桥收费站':[118.06276,37.34308],
                            '大高收费站':[117.85896,37.6098],
                            '大高收费站':[117.85906,37.6099],
                            '滨城收费站':[117.90647,37.41418],
                            '吴坝乡将军渡浮桥收费站':[116.07403,36.04348],
                            '天桥收费站':[116.92877,36.71978],
                            '昆岳浮桥收费站':[115.707,35.83055],
                            '恒通浮桥收费站':[115.56389,35.73397],
                            '天桥收费站':[116.9286,36.71966],
                            '莱芜高新区收费站':[117.72466,36.25357],
                            '崮山收费站':[116.84722,36.55182],
                            '莱芜高新区收费站':[117.72455,36.2536],
                            '省道二五四线武城收费站':[116.23973,37.31572],
                            '省道二五四线武城收费站':[116.23973,37.31579],
                            '德州东收费站':[116.45217,37.47373],
                            '德州东收费站':[116.45199,37.47379],
                            '宁津收费站':[116.7952,37.56841],
                            '宁津收费站':[116.79494,37.56844],
                            '庆云收费站':[117.41012,37.70236],
                            '庆云收费站':[117.41011,37.70251],
                            '淄川收费站':[117.99028,36.68172],
                            '平阴浮桥收费站':[116.44733,36.3288],
                            '无棣东收费站':[117.72297,37.70316],
                            '阳信收费站':[117.63737,37.68439],
                            '岚济线济邹公路收费站':[116.74606,35.35547],
                            '岚济线济邹公路收费站':[116.74615,35.35552],
                            '无棣东收费站':[117.72331,37.70304],
                            '平原南收费站':[116.56905,37.12583],
                            '平阴收费站':[116.48204,36.27701],
                            '平阴收费站':[116.48196,36.27696],
                            '曹县收费站':[115.64819,34.77878],
                            '曹县收费站':[115.64827,34.77876],
                            '平原南收费站':[116.56525,37.12236],
                            '平原南收费站':[116.5652,37.1223],
                            '平原南收费站':[116.56893,37.12576],
                            '沂源东收费站':[118.236,36.17993],
                            '山东黄河寿张收费站':[115.84724,36.00595],
                            '娄集浮桥收费站':[116.61684,36.44409],
                            '景店收费站':[115.55923,35.0419],
                            '高唐西收费站':[116.15468,36.89071],
                            '阳信收费站':[117.63708,37.68441],
                            '高唐西收费站':[116.15453,36.89097],
                            '沂源东收费站':[118.23608,36.17995],
                            '博山收费站':[117.83775,36.52509],
                            '济宁收费站':[116.66146,35.5267],
                            '济宁收费站':[116.66156,35.5267],
                            '曲阜收费站':[117.04332,35.59993],
                            '曲阜收费站':[117.04347,35.59995],
                            '高青北收费站':[117.9663,37.24447],
                            '阳谷收费站':[115.91574,36.29881],
                            '阳谷收费站':[115.91556,36.29886],
                            '黄金浮桥收费站':[116.49953,36.35863],
                            '泰安西收费站':[117.02264,36.18469],
                            '黄金浮桥收费站':[116.49316,36.35895],
                            '平原收费站':[116.4918,37.21645],
                            '平原收费站':[116.49176,37.21658],
                            '泰安西收费站':[117.02289,36.18463],
                            '郓城南收费站':[116.03615,35.45844],
                            '郓城南收费站':[116.03613,35.4585],
                            '晏城收费站':[116.7234,36.72499],
                            '晏城收费站':[116.72333,36.725],
                            '茌平西收费站':[116.21207,36.53858],
                            '茌平西收费站':[116.21192,36.53848],
                            '济阳收费站':[117.11612,36.84491],
                            '济阳收费站':[117.11604,36.84487],
                            '靳家收费站':[117.00753,36.84365],
                            '靳家收费站':[117.00748,36.84358],
                            '嘉祥收费站':[116.14204,35.61037],
                            '嘉祥收费站':[116.14212,35.61026],
                            '淄川收费站':[117.88183,36.66163],
                            '苗山收费站':[117.78777,36.32376],
                            '苗山收费站':[117.78793,36.32367],
                            '二四二省道枣园收费站':[117.6079,36.34753],
                            '二四二省道枣园收费站':[117.60801,36.34755],
                            '高唐东收费站':[116.37697,36.89853],
                            '高唐东收费站':[116.37698,36.89861],
                            '菏泽南收费站':[115.50751,35.15166],
                            '菏泽南收费站':[115.50742,35.15167],
                            '二二零国道济阳收费站':[117.2823,37.0927],
                            '二二零国道济阳收费站':[117.28244,37.09263],
                            '新泰西收费站':[117.53737,35.94853],
                            '新泰西收费站':[117.53733,35.94865],
                            '辛庄收费站':[117.82896,36.23678],
                            '济南西收费站':[116.88756,36.65247],
                            '辛庄收费站':[117.82889,36.23669],
                            '滨州收费站':[117.66804,37.72085],
                            '滨州收费站':[117.66792,37.72079],
                            '长清收费站':[116.72798,36.48164],
                            '冠县东收费站':[115.6651,36.48966],
                            '泰安收费站':[117.21744,36.18912],
                            '济南西收费站':[116.88739,36.65238],
                            '冠县东收费站':[115.66518,36.48964],
                            '泰安收费站':[117.21741,36.18944],
                            '滨州黄河大桥收费站':[118.06926,37.33035],
                            '济南南收费站':[116.99333,36.54988],
                            '滨州黄河大桥收费站':[118.06931,37.33041],
                            '梁山收费站':[116.22221,35.68446],
                            '滨州黄河公铁大桥收费站':[118.08343,37.33019],
                            '济南南收费站':[116.99475,36.55008],
                            '梁山收费站':[116.22217,35.68455],
                            '濮城收费站':[115.38425,35.77588],
                            '范县收费站':[115.49408,35.79558],
                            '濮城收费站':[115.38437,35.77587],
                            '银河浮桥收费站':[116.08979,36.06123],
                            '银河浮桥收费站':[116.09528,36.0568],
                            '李庄收费站':[118.59389,37.24538],
                            '李庄收费站':[118.59372,37.2454],
                            '长清收费站':[116.72803,36.48158],
                            '桓台收费站':[117.96848,36.9545],
                            '桓台收费站':[117.96843,36.95449],
                            '大桥收费站':[117.03863,36.74703],
                            '茌平收费站':[116.26185,36.55294],
                            '茌平收费站':[116.26196,36.55297],
                            '济南黄河公路大桥收费站':[117.04031,36.73924],
                            '东明收费站':[115.1307,35.30745],
                            '郭店收费站':[117.20795,36.72493],
                            '省道２３０田庄收费站':[118.64653,37.35281],
                            '临邑收费站':[117.03057,37.1521],
                            '省道２３０田庄收费站':[118.64668,37.35282],
                            '济阳北收费站':[117.03737,37.06689],
                            '东明收费站':[115.13062,35.30735],
                            '滨州黄河公铁大桥收费站':[118.08332,37.33026],
                            '满庄收费站':[117.09565,36.03391],
                            '商河收费站':[117.09136,37.26777],
                            '省道１０２线２－１收费站':[117.3383,36.73751],
                            '东营北收费站':[118.60046,37.46856],
                            '肥城收费站':[116.84969,36.16104],
                            '济南东收费站':[117.21005,36.67656],
                            '肥城收费站':[116.84971,36.1609],
                            '济南东收费站':[117.21017,36.67653],
                            '乐陵南收费站':[117.12892,37.51867],
                            '商河收费站':[117.09123,37.26777],
                            '济阳西收费站':[117.05537,36.9736],
                            '东营北收费站':[118.60039,37.46857],
                            '济阳北收费站':[117.03727,37.06687],
                            '济阳西收费站':[117.05528,36.97361],
                            '临邑收费站':[117.03066,37.15214],
                            '莱芜东收费站':[117.74407,36.19352],
                            '莱芜东收费站':[117.73983,36.19727],
                            '莱芜南收费站':[117.69849,36.18346],
                            '莱芜东收费站':[117.74397,36.19352],
                            '曹县西收费站':[115.23833,35.04841],
                            '莱芜南收费站':[117.69848,36.18353],
                            '巨野收费站':[116.18889,35.39946],
                            '巨野收费站':[116.18888,35.39958],
                            '曹县西收费站':[115.23825,35.04837],
                            '莱芜东收费站':[117.73995,36.19726],
                            '淄川收费站':[117.9904,36.68169],
                            '临邹路收费站':[115.91951,36.54037],
                            '国道２０５线淄博收费站':[117.9387,36.68984],
                            '临邹路收费站':[115.91965,36.54046],
                            '国道２０５线淄博收费站':[117.93858,36.68989],
                            '省道２３９线惠民收费站':[117.49057,37.43105],
                            '一零五国道济宁收费站':[116.40385,35.21134],
                            '省道２３９线惠民收费站':[117.49067,37.43105],
                            '一零五国道济宁收费站':[116.40377,35.21146],
                            '垦利北收费站':[118.61142,37.57502],
                            '国道３０９线济南收费站':[117.64604,36.66892],
                            '垦利北收费站':[118.61153,37.57508],
                            '雪野收费站':[117.53088,36.45406],
                            '国道３０９线济南收费站':[117.64601,36.66883],
                            '雪野收费站':[117.53095,36.45402],
                            '满庄收费站':[117.09565,36.03379],
                            '乐陵南收费站':[117.12896,37.51898],
                            '燕李浮桥收费站':[116.54254,36.40221],
                            '燕李浮桥收费站':[116.53754,36.40521],
                            '青岛收费站':[120.28276,36.38911],
                            '青岛收费站':[120.28265,36.38902],
                            '穴坊收费站':[120.7412,36.62778],
                            '沙河收费站':[119.80392,37.02154],
                            '沙河收费站':[119.80404,37.02154],
                            '阳河收费站':[118.54734,36.9172],
                            '阳河收费站':[118.54734,36.91727],
                            '大王收费站':[118.54103,36.97533],
                            '朱里收费站':[119.39958,36.74521],
                            '石埠收费站':[119.46973,36.74995],
                            '崖逄收费站':[120.07273,36.09112],
                            '朱里收费站':[119.39949,36.74521],
                            '崖逄收费站':[120.07034,36.08817],
                            '崖逄收费站':[120.07274,36.0912],
                            '胶州收费站':[120.07512,36.22611],
                            '平度南收费站':[119.95851,36.70789],
                            '石埠收费站':[119.46984,36.74992],
                            '胶州收费站':[120.0752,36.22619],
                            '兰陵北收费站':[118.12043,34.90891],
                            '河东收费站':[118.62534,35.23181],
                            '高里收费站':[118.39748,35.38846],
                            '枣庄新城收费站':[117.3857,34.70771],
                            '河东收费站':[118.62542,35.23189],
                            '峄城西收费站':[117.55449,34.72714],
                            '峄城西收费站':[117.55449,34.72703],
                            '峄城南收费站':[117.63202,34.72812],
                            '高里收费站':[118.3973,35.3884],
                            '烟台南收费站':[121.44896,37.28408],
                            '枣庄新城收费站':[117.38571,34.70782],
                            '烟台南收费站':[121.44883,37.28405],
                            '省道潍胶路坊子收费站':[119.3757,36.60278],
                            '牟平南收费站':[121.42004,37.18055],
                            '牟平南收费站':[121.42001,37.18062],
                            '泊里收费站':[119.73464,35.69905],
                            '泊里收费站':[119.7345,35.69899],
                            '兰陵北收费站':[118.12053,34.90907],
                            '省道潍胶路坊子收费站':[119.37669,36.60216],
                            '莱山收费站':[121.41537,37.43334],
                            '莱山收费站':[121.41545,37.43323],
                            '峄城南收费站':[117.63211,34.72803],
                            '临沂玉平沂河大桥收费站':[118.48314,35.24379],
                            '临沂玉平沂河大桥收费站':[118.48311,35.24363],
                            '烟台西港收费站':[121.11751,37.66679],
                            '烟台西港收费站':[121.11733,37.66679],
                            '滕州收费站':[117.19069,35.12721],
                            '滕州收费站':[117.19078,35.12725],
                            '烟台机场收费站':[121.00637,37.63545],
                            '诸葛收费站':[118.54894,36.034],
                            '诸葛收费站':[118.54889,36.03406],
                            '即墨西收费站':[120.38689,36.37666],
                            '即墨西收费站':[120.38703,36.37662],
                            '烟台机场收费站':[121.00664,37.63548],
                            '姜山收费站':[120.5219,36.63861],
                            '龙泉收费站':[120.5591,36.45894],
                            '莱西东收费站':[120.59126,36.89638],
                            '龙口港收费站':[120.36608,37.59613],
                            '招远北收费站':[120.31081,37.46404],
                            '龙口港收费站':[120.36575,37.59619],
                            '坊子收费站':[119.17723,36.61795],
                            '招远北收费站':[120.31083,37.46414],
                            '胶南北收费站':[120.0014,35.92798],
                            '胶南北收费站':[120.0013,35.9279],
                            '云山收费站':[120.25526,36.83643],
                            '胶南收费站':[119.99734,36.04618],
                            '云山收费站':[120.25528,36.83649],
                            '留格庄收费站':[121.34216,36.77959],
                            '坊子收费站':[119.17722,36.61805],
                            '留格庄收费站':[121.34208,36.77967],
                            '胶南收费站':[119.99738,36.04612],
                            '青州东收费站':[118.62074,36.78709],
                            '沂南东收费站':[118.64762,35.50581],
                            '团旺收费站':[120.55453,36.75886],
                            '团旺收费站':[120.55439,36.75886],
                            '青州东收费站':[118.62057,36.78717],
                            '华山东收费站':[120.56146,36.54387],
                            '龙泉收费站':[120.55902,36.45884],
                            '惜福收费站':[120.51937,36.33073],
                            '即墨东收费站':[120.55069,36.40307],
                            '惜福收费站':[120.51937,36.33067],
                            '沂南东收费站':[118.64758,35.50574],
                            '华山东收费站':[120.56124,36.54389],
                            '莱西东收费站':[120.59135,36.89645],
                            '姜山收费站':[120.52171,36.63861],
                            '北海收费站':[121.93641,37.46728],
                            '北海收费站':[121.9339,37.46463],
                            '北海收费站':[121.93388,37.46462],
                            '北海收费站':[121.93617,37.4675],
                            '大王收费站':[118.54094,36.97533],
                            '临沂东收费站':[118.60461,35.12367],
                            '大窑收费站':[121.69801,37.40236],
                            '临沂东收费站':[118.60471,35.12358],
                            '兰陵西收费站':[117.95722,34.87185],
                            '兰陵西收费站':[117.95727,34.87174],
                            '城阳收费站':[120.42113,36.28184],
                            '李村收费站':[120.44704,36.16087],
                            '城阳收费站':[120.42075,36.28224],
                            '峄城东收费站':[117.7658,34.81895],
                            '３０９国道潍坊收费站':[118.94436,36.72456],
                            '即墨东收费站':[120.55086,36.40311],
                            '峄城东收费站':[117.76577,34.81887],
                            '李村收费站':[120.44706,36.16077],
                            '枣庄东城收费站':[117.519,34.89253],
                            '３０９国道潍坊收费站':[118.94435,36.72449],
                            '大官庄枢纽收费站':[118.5572,34.80133],
                            '枣庄东城收费站':[117.51893,34.89241],
                            '涛雒收费站':[119.35869,35.28124],
                            '三二七国道泗水收费站':[117.34811,35.65792],
                            '涛雒收费站':[119.35872,35.28134],
                            '三二七国道泗水收费站':[117.34687,35.65805],
                            '枣庄收费站':[117.29399,34.80915],
                            '双岛收费站':[121.97693,37.47581],
                            '枣庄收费站':[117.29391,34.80908],
                            '双岛收费站':[121.97685,37.4759],
                            '青州北收费站':[118.53912,36.78185],
                            '青州北收费站':[118.5391,36.78191],
                            '黄岛西收费站':[120.1088,36.03541],
                            '蓬莱西收费站':[120.69074,37.6374],
                            '黄岛西收费站':[120.10881,36.03552],
                            '灵珠山收费站':[120.08712,36.02826],
                            '黄岛收费站':[120.14468,36.06576],
                            '灵珠山收费站':[120.0872,36.02835],
                            '黄岛收费站':[120.14423,36.06533],
                            '临沭收费站':[118.73984,34.91732],
                            '临沭收费站':[118.73977,34.91743],
                            '临沭北收费站':[118.66831,35.04434],
                            '临沭北收费站':[118.66837,35.04444],
                            '蓬莱西收费站':[120.69062,37.63743],
                            '中桥收费站':[121.0711,37.49748],
                            '青州收费站':[118.57393,36.72407],
                            '罗庄收费站':[118.22435,35.02166],
                            '中桥收费站':[121.07113,37.49741],
                            '青州南收费站':[118.59395,36.62359],
                            '胶州湾大桥收费站':[120.35841,36.15417],
                            '临朐收费站':[118.61999,36.51525],
                            '胶州湾大桥收费站':[120.35859,36.15342],
                            '济青高速潍坊收费站':[119.16588,36.7484],
                            '青州收费站':[118.57401,36.72414],
                            '胶州湾大桥收费站':[120.36591,36.16426],
                            '青州南收费站':[118.59385,36.6236],
                            '胶州湾大桥收费站':[120.3639,36.16072],
                            '沂山收费站':[118.71364,36.24676],
                            '沂南北收费站':[118.66461,35.58729],
                            '临朐收费站':[118.62007,36.51521],
                            '沂山收费站':[118.71352,36.24671],
                            '明村收费站':[119.63632,36.76223],
                            '明村收费站':[119.63634,36.76229],
                            '罗庄收费站':[118.22438,35.02175],
                            '沂南北收费站':[118.66474,35.58729],
                            '东厅收费站':[121.22685,37.47614],
                            '牟平东收费站':[121.68131,37.43159],
                            '东厅收费站':[121.22697,37.47613],
                            '寿光收费站':[118.73649,36.75935],
                            '二零六国道峄城收费站':[117.5571,34.60768],
                            '省道３２０线寒亭收费站':[119.25289,36.98582],
                            '省道３２０线寒亭收费站':[119.2529,36.98596],
                            '酒馆收费站':[121.88133,37.45018],
                            '酒馆收费站':[121.8814,37.45019],
                            '昌乐收费站':[118.85411,36.75714],
                            '莒县东收费站':[118.83123,35.45697],
                            '沂水南收费站':[118.69858,35.6959],
                            '莒县东收费站':[118.83123,35.45689],
                            '沂水南收费站':[118.69846,35.6959],
                            '临沂收费站':[118.25481,35.13769],
                            '沂水收费站':[118.67329,35.80467],
                            '临沂收费站':[118.25493,35.13776],
                            '沂水收费站':[118.67326,35.80478],
                            '西湖收费站':[119.22918,35.49231],
                            '沂水北收费站':[118.72245,35.98607],
                            '西湖收费站':[119.22919,35.49216],
                            '沂水北收费站':[118.72245,35.98615],
                            '二零六国道峄城收费站':[117.55721,34.6077],
                            '胶州收费站':[119.99485,36.40519],
                            '寿光收费站':[118.7361,36.75698],
                            '寿光收费站':[118.7361,36.75707],
                            '寿光收费站':[118.73648,36.75928],
                            '平邑东收费站':[117.76136,35.4363],
                            '胶州收费站':[119.99495,36.40519],
                            '昌乐收费站':[118.85423,36.75724],
                            '平邑东收费站':[117.76143,35.43627],
                            '移风收费站':[120.20369,36.54528],
                            '移风收费站':[120.20359,36.54523],
                            '莱州收费站':[119.93671,37.04383],
                            '莱州收费站':[119.93686,37.04384],
                            '河套收费站':[120.16409,36.24256],
                            '河套收费站':[120.16412,36.24258],
                            '河套收费站':[120.16268,36.23952],
                            '河套收费站':[120.16273,36.23954],
                            '青岛市高速公路管理处机场路分处李村收费站':[120.44678,36.16217],
                            '胶州收费站':[119.95404,36.24649],
                            '胶州收费站':[119.95405,36.24641],
                            '省道２９３胶南收费站':[119.9579,35.80507],
                            '省道２９３胶南收费站':[119.95782,35.80518],
                            '日照收费站':[119.42675,35.41166],
                            '日照收费站':[119.42675,35.41152],
                            '寿光西收费站':[118.71952,37.07391],
                            '寿光西收费站':[118.71968,37.07403],
                            '店集收费站':[120.66164,36.5788],
                            '店集收费站':[120.6617,36.57874],
                            '南村收费站':[120.1152,36.5557],
                            '南村收费站':[120.11532,36.55559],
                            '潍城收费站':[119.0345,36.7474],
                            '潍城收费站':[119.03447,36.74732],
                            '蓝村收费站':[120.17623,36.42334],
                            '青驼收费站':[118.26005,35.41116],
                            '青驼收费站':[118.26007,35.41107],
                            '即墨收费站':[120.2944,36.37517],
                            '牟平东收费站':[121.68126,37.43156],
                            '即墨收费站':[120.29572,36.37895],
                            '即墨收费站':[120.29572,36.37904],
                            '青岛收费站':[120.33744,36.33873],
                            '青岛收费站':[120.33688,36.33853],
                            '灰埠收费站':[119.71767,36.98071],
                            '灰埠收费站':[119.71776,36.98075],
                            '即墨收费站':[120.29439,36.37524],
                            '蓝村收费站':[120.17622,36.42325],
                            '潍安路收费站':[119.22226,36.56408],
                            '乳山收费站':[121.54061,36.88129],
                            '乳山收费站':[121.54057,36.88129],
                            '乳山收费站':[121.54524,36.87921],
                            '乳山收费站':[121.5452,36.87921],
                            '海阳收费站':[121.20748,36.75513],
                            '海阳收费站':[121.20702,36.75496],
                            '海阳收费站':[121.20343,36.76051],
                            '海阳收费站':[121.20291,36.76037],
                            '莱州收费站':[119.93492,37.13349],
                            '费县收费站':[117.94913,35.3731],
                            '莱州收费站':[119.93497,37.13339],
                            '蓝村收费站':[120.17627,36.42065],
                            '蓝村收费站':[120.17627,36.42057],
                            '大场收费站':[119.63495,35.64653],
                            '大场收费站':[119.63496,35.64661],
                            '乳山东收费站':[121.59262,36.91074],
                            '海阳西收费站':[121.1206,36.72796],
                            '费县收费站':[117.94913,35.37318],
                            '乳山东收费站':[121.59263,36.91086],
                            '栖霞南收费站':[120.67859,37.19885],
                            '南黄收费站':[121.79394,36.96895],
                            '栖霞南收费站':[120.67868,37.19887],
                            '海阳西收费站':[121.12069,36.72793],
                            '张舍收费站':[119.73477,36.87209],
                            '张舍收费站':[119.73466,36.87204],
                            '牛溪埠收费站':[120.42291,36.84096],
                            '牛溪埠收费站':[120.42283,36.84093],
                            '南黄收费站':[121.79393,36.96902],
                            '下营收费站':[119.47661,36.95933],
                            '文登收费站':[122.00751,37.16811],
                            '古现收费站':[121.11146,37.57383],
                            '下营收费站':[119.47657,36.95943],
                            '文登收费站':[122.00746,37.16825],
                            '东红路梅埠收费站':[118.44407,34.93379],
                            '昌邑收费站':[119.39136,36.95801],
                            '昌邑收费站':[119.39137,36.9581],
                            '古现收费站':[121.11156,37.57388],
                            '威青华山收费站':[120.52402,36.50391],
                            '羊郡收费站':[120.82844,36.65742],
                            '崖逄收费站':[120.07035,36.08824],
                            '灵山收费站':[120.47082,36.49361],
                            '收费站':[120.67911,36.22994],
                            '羊郡收费站':[120.82856,36.65745],
                            '广饶收费站':[118.53625,37.04233],
                            '广饶收费站':[118.53635,37.04231],
                            '灵山收费站':[120.4708,36.49371],
                            '威青华山收费站':[120.524,36.50381],
                            '诸城收费站':[119.40221,36.07976],
                            '胶州湾大桥收费站':[120.36927,36.15499],
                            '诸城收费站':[119.40216,36.07969],
                            '诸城东收费站':[119.47686,36.06651],
                            '诸城东收费站':[119.47691,36.06643],
                            '胶州湾大桥收费站':[120.36992,36.15537],
                            '长直收费站':[120.4019,36.46561],
                            '长直收费站':[120.40178,36.46563],
                            '孟良崮收费站':[118.15445,35.53793],
                            '潍安路收费站':[119.22217,36.56408],
                            '孟良崮收费站':[118.15445,35.53801],
                            '新河收费站':[119.61038,36.94776],
                            '新河收费站':[119.61043,36.94765],
                            '武备收费站':[120.33913,36.85357],
                            '武备收费站':[120.33916,36.85361],
                            '莱西收费站':[120.50235,36.91464],
                            '莱西收费站':[120.50245,36.91466],
                            '青岛胶州湾隧道收费站':[120.28922,35.9962],
                            '青岛胶州湾隧道收费站':[120.28815,35.99615],
                            '栖霞收费站':[120.76257,37.31672],
                            '栖霞收费站':[120.76248,37.31672],
                            '辛兴收费站':[119.58998,36.06033],
                            '辛兴收费站':[119.58996,36.06021],
                            '莱阳收费站':[120.63056,37.13551],
                            '莱阳收费站':[120.63063,37.13548],
                            '海阳东收费站':[121.29412,36.76394],
                            '海阳东收费站':[121.29361,36.764],
                            '威海南海收费站':[121.90675,37.05707],
                            '威海收费站':[122.11449,37.2965],
                            '威海收费站':[122.11434,37.29675],
                            '胶南收费站':[119.93953,35.8904],
                            '杜家疃收费站':[121.3608,37.43738],
                            '杜家疃收费站':[121.36084,37.4373],
                            '崇义收费站':[121.26859,37.46288],
                            '崇义收费站':[121.26867,37.46293],
                            '院上收费站':[120.34317,36.76333],
                            '日照港收费站':[119.41739,35.37251],
                            '院上收费站':[120.34324,36.76346],
                            '日照港收费站':[119.41786,35.37311],
                            '胶南收费站':[119.93959,35.89029],
                            '寿光北收费站':[118.86999,37.02089],
                            '寿光北收费站':[118.87,37.0208],
                            '文登收费站':[121.8944,37.14441],
                            '平度南收费站':[119.95839,36.70787],
                            '威海南海收费站':[121.90682,37.05704],
                            '文登收费站':[121.89437,37.14449],
                            '潍坊东收费站':[119.24677,36.7123],
                            '周格庄收费站':[120.57098,36.92854],
                            '周格庄收费站':[120.57106,36.92871],
                            '青岛东收费站':[120.4528,36.13789],
                            '青岛东收费站':[120.45374,36.13794],
                            '兰陵收费站':[118.20736,34.86209],
                            '兰陵收费站':[118.20749,34.86208],
                            '三城公路平度收费站':[120.10316,36.60002],
                            '莒县收费站':[118.72023,35.44005],
                            '莒县收费站':[118.72023,35.43995],
                            '沂南收费站':[118.50344,35.39867],
                            '沂南收费站':[118.50341,35.39874],
                            '高速公路收费站':[121.41604,37.4324],
                            '莱州东收费站':[120.06384,37.22737],
                            '莱州东收费站':[120.06391,37.22726],
                            '黄城收费站':[120.50029,37.61631],
                            '黄城收费站':[120.5002,37.61639],
                            '河头店收费站':[120.5633,37.02236],
                            '三城公路平度收费站':[120.10306,36.59999],
                            '三零九国道临淄收费站':[118.39301,36.79617],
                            '三零九国道临淄收费站':[118.39293,36.79611],
                            '招远收费站':[120.25928,37.39633],
                            '招远收费站':[120.25928,37.39644],
                            '潍坊北收费站':[119.1648,36.97778],
                            '河头店收费站':[120.56325,37.0223],
                            '潍坊北收费站':[119.16492,36.97776],
                            '八角收费站':[121.10263,37.64992],
                            '莱州港收费站':[120.00791,37.37421],
                            '八角收费站':[121.10268,37.65008],
                            '莱州港收费站':[120.00822,37.37445],
                            '昌乐收费站':[118.85021,36.7532],
                            '昌乐收费站':[118.85029,36.75329],
                            '青州西收费站':[118.50049,36.81344],
                            '青州西收费站':[118.50045,36.81366],
                            '日照北收费站':[119.47579,35.47807],
                            '平度收费站':[119.89151,36.80845],
                            '日照北收费站':[119.47592,35.47817],
                            '蓬莱收费站':[121.00378,37.71746],
                            '峄城收费站':[117.41331,34.60779],
                            '蓬莱收费站':[121.00369,37.71741],
                            '文登北收费站':[122.05888,37.24879],
                            '峄城收费站':[117.4132,34.60781],
                            '平度收费站':[119.89465,36.80609],
                            '郭庄收费站':[120.10175,36.60816],
                            '平度收费站':[119.89476,36.80597],
                            '郭庄收费站':[120.10171,36.60824],
                            '平度收费站':[119.89141,36.80855],
                            '潍坊收费站':[119.16293,36.74919],
                            '潍坊收费站':[119.16289,36.74911],
                            '朱桥收费站':[120.15275,37.2851],
                            '朱桥收费站':[120.15268,37.28518],
                            '潍坊东收费站':[119.24566,36.71548],
                            '潍坊收费站':[119.16436,36.74591],
                            '潍坊收费站':[119.16436,36.74582],
                            '诸往收费站':[121.36293,36.95753],
                            '诸往收费站':[121.36299,36.95762],
                            '乳山北收费站':[121.37612,37.01024],
                            '张家坡收费站':[118.42933,36.08078],
                            '乳山北收费站':[121.37603,37.01021],
                            '海阳北收费站':[121.30621,36.88083],
                            '平邑收费站':[117.64428,35.45153],
                            '城阳北收费站':[120.42412,36.32493],
                            '３０９国道乳山收费站':[121.35407,37.01015],
                            '海阳北收费站':[121.30637,36.88083],
                            '城阳南收费站':[120.43452,36.29047],
                            '城阳北收费站':[120.42412,36.3248],
                            '张家坡收费站':[118.42925,36.08065],
                            '城阳南收费站':[120.43425,36.29058],
                            '平邑收费站':[117.64426,35.45162],
                            '临沂北收费站':[118.25916,35.27408],
                            '木石收费站':[117.26865,34.97985],
                            '木石收费站':[117.26853,34.97972],
                            '红岛南收费站':[120.30107,36.18839],
                            '红岛南收费站':[120.30092,36.1884],
                            '潍坊东收费站':[119.24568,36.71535],
                            '潍坊东收费站':[119.24701,36.71201],
                            '青岛西女姑山收费站':[120.34076,36.23998],
                            '青岛西女姑山收费站':[120.34066,36.23954],
                            '孟疃收费站':[119.05613,36.04617],
                            '高新区收费站':[120.2573,36.23163],
                            '孟疃收费站':[119.05618,36.04626],
                            '高新区收费站':[120.25742,36.23167],
                            '高新区收费站':[120.2595,36.23447],
                            '泗水收费站':[117.24303,35.55269],
                            '高新区收费站':[120.25937,36.23443],
                            '泗水收费站':[117.24311,35.55269],
                            '胶州收费站':[119.79758,36.05157],
                            '仁兆收费站':[120.19044,36.62314],
                            '胶州收费站':[119.79756,36.05166],
                            '平度东收费站':[120.06873,36.80152],
                            '３０９国道乳山收费站':[121.3541,37.01023],
                            '仁兆收费站':[120.19036,36.62323],
                            '平度东收费站':[120.06874,36.80159],
                            '龙山收费站':[119.01907,35.49417],
                            '夏庄收费站':[120.43189,36.24974],
                            '龙山收费站':[119.01897,35.49421],
                            '山亭南收费站':[117.40377,34.94177],
                            '李村广水路收费站':[120.43874,36.17989],
                            '山亭南收费站':[117.40377,34.94186],
                            '李村广水路收费站':[120.43799,36.18641],
                            '夏庄收费站':[120.43184,36.24975],
                            '辛安收费站':[120.99956,36.67076],
                            '辛安收费站':[120.99946,36.67081],
                            '行村收费站':[120.91097,36.67334],
                            '蒙阴收费站':[117.93523,35.68874],
                            '行村收费站':[120.91103,36.67341],
                            '蒙阴收费站':[117.93509,35.68879],
                            '机场收费站':[120.42849,36.25265],
                            '２０６国道安丘汶河大桥收费站':[119.17707,36.48077],
                            '机场收费站':[120.42837,36.25252],
                            '普东收费站':[120.30984,36.46499],
                            '普东收费站':[120.30973,36.465],
                            '滕州南收费站':[117.2221,34.99826],
                            '九龙收费站':[119.97819,36.16663],
                            '田庄收费站':[119.75134,36.77741],
                            '王台收费站':[119.98372,36.08353],
                            '九龙收费站':[119.9781,36.16663],
                            '王台收费站':[119.98362,36.08352],
                            '蓬莱收费站':[120.86446,37.63451],
                            '蓬莱收费站':[120.86444,37.63441],
                            '２０６国道安丘汶河大桥收费站':[119.17699,36.48073],
                            '龙口收费站':[120.27422,37.53466],
                            '龙口收费站':[120.2744,37.53466],
                            '滕州南收费站':[117.22201,34.99817],
                            '龙口收费站':[120.35085,37.53911],
                            '泉林收费站':[117.39487,35.49318],
                            '龙口收费站':[120.35078,37.53905],
                            '泉林收费站':[117.39478,35.49312],
                            '栖霞北收费站':[120.87779,37.42357],
                            '栖霞北收费站':[120.87772,37.42359],
                            '杨庄收费站':[118.86705,36.03804],
                            '杨庄收费站':[118.86708,36.03814],
                            '福山收费站':[121.2201,37.53071],
                            '临沂北收费站':[118.25917,35.27413],
                            '福山收费站':[121.22013,37.53055],
                            '临沂北收费站':[118.25478,35.27109],
                            '养马岛收费站':[121.59863,37.42002],
                            '临沂北收费站':[118.25481,35.27109],
                            '养马岛收费站':[121.59814,37.42002],
                            '养马岛收费站':[121.59827,37.42547],
                            '郯城收费站':[118.24291,34.64241],
                            '养马岛收费站':[121.59871,37.42549],
                            '乳山西收费站':[121.42587,36.84808],
                            '郯城收费站':[118.24277,34.64241],
                            '乳山西收费站':[121.42586,36.84801],
                            '穴坊收费站':[120.74128,36.62772],
                            '东红路梅埠收费站':[118.44399,34.93384],
                            '文登北收费站':[122.05876,37.24886],
                            '寿光东收费站':[118.97322,37.01058],
                            '寿光东收费站':[118.97321,37.01052],
                            '省道２６４线莱州收费站':[119.86081,37.12566],
                            '诸城西收费站':[119.21725,36.05774],
                            '３０９国道胶莱河收费站':[119.53123,36.74039],
                            '臧家庄收费站':[120.99522,37.4771],
                            '高密收费站':[119.78369,36.46378],
                            '诸城西收费站':[119.21715,36.05783],
                            '３０９国道胶莱河收费站':[119.5312,36.74048],
                            '高密收费站':[119.7874,36.46644],
                            '高密收费站':[119.7838,36.46387],
                            '臧家庄收费站':[120.99528,37.47705],
                            '高密收费站':[119.78751,36.46655],
                            '初村收费站':[121.92687,37.42069],
                            '初村收费站':[121.92678,37.42066],
                            '烟台收费站':[121.47246,37.44127],
                            '烟台收费站':[121.47291,37.44168],
                            '省道２６４线莱州收费站':[119.86079,37.12575],
                            '临朐南收费站':[118.64266,36.41924],
                            '峡山收费站':[119.47113,36.63163],
                            '临朐南收费站':[118.64251,36.41922],
                            '峡山收费站':[119.47122,36.63167],
                            '田庄收费站':[119.75134,36.7775],
                        },

                        markLine: {
                            smooth: true,
                            effect: {
                                show: true,
                                scaleSize: 1,
                                period: 30,
                                color: '#fff',
                                shadowBlur: 10
                            },
                            itemStyle: {
                                normal: {
                                    borderWidth: 1,
                                    lineStyle: {
                                        type: 'solid',
                                        shadowBlur: 10
                                    }
                                }
                            },
                            data: [
                                [{ name: '华山收费站' }, { name: '济南西收费站', value: 118 }],
                                [{ name: '华山收费站' }, { name: '临邑收费站', value: 80 }],
                                [{ name: '华山收费站' }, { name: '商河收费站', value: 39 }],
                                [{ name: '华山收费站' }, { name: '泰安东收费站', value: 173 }],
                                [{ name: '华山收费站' }, { name: '茌平收费站', value: 76 }],
                                [{ name: '华山收费站' }, { name: '河头店收费站', value: 57 }],
                                [{ name: '华山收费站' }, { name: '平阴收费站', value: 80 }],
                                [{ name: '华山收费站' }, { name: '崮山收费站', value: 111 }],
                                [{ name: '华山收费站' }, { name: '遥墙收费站', value: 4 }],

                            ]
                        },

                    }, {
                        name: '开始站之青岛东收费站',
                        type: 'map',
                        mapType: 'none',
                        data: [],
                        markLine: {
                            smooth: true,
                            effect: {
                                show: true,
                                scaleSize: 1,
                                period: 30,
                                color: '#fff',
                                shadowBlur: 10
                            },
                            itemStyle: {
                                normal: {
                                    borderWidth: 1,
                                    lineStyle: {
                                        type: 'solid',
                                        shadowBlur: 10
                                    }
                                }
                            },
                            data: [
                                [{ name: '青岛东收费站' }, { name: '即墨西收费站', value: 599 }],
                                [{ name: '青岛东收费站' }, { name: '平度南收费站', value: 142 }],
                                [{ name: '青岛东收费站' }, { name: '夏庄收费站', value: 7761 }],
                                [{ name: '青岛东收费站' }, { name: '华山东收费站', value: 10 }],
                                [{ name: '青岛东收费站' }, { name: '平度收费站', value: 7 }],
                                [{ name: '青岛东收费站' }, { name: '潍坊北收费站', value: 13 }],
                            ]
                        },
                    }

                    ]

                };




                var myChart = BMapExt.initECharts(container);
                BMapExt.setOption(option);
                var ecConfig = require('echarts/config');
            });
    })();



</script>
</html>

